#include <iostream>
#include <locale>
#include <tchar.h>

int _tmain(int argc, _TCHAR* argv[])
{
    unsigned int n; // Число секунд, прошедших с полуночи
    // Установка русской локали для терминала Windows 11
    system("chcp 1251 >nul"); // 1-й способ. Выплнить внешнюю команду.
    // 2 - й способ. Вызов библиотечной функции
    setlocale(LC_ALL, "russian.1251");
    // 3 - й способ. Создать переменную типа локали
    std::locale rus_locale = std::locale("russian.1251");
    // 3 - й способ. Выбор кодировки(локали) терминала
    std::cout.imbue(std::locale::global(rus_locale));
    /*Ввод значений переменных с клавиатуры*/
    std::cout << "Введите число секунд, прошедших с полуночи: ";
    std::cin >> n; // Ввод переменной
    unsigned int h = n / 3600; // Количество полных часов
    unsigned int m = (n / 60) % 60; // Количество оставшихся полных минут
    unsigned int s = n % 60; // Количество оставшихся секунд
    // --Вывод информации на экран--
    std::cout << "Количество полных часов с полуночи:" << h << "\r\n";
    std::cout << "Количество оставшихся полных минут с полуночи: "
    		  << m << "\r\n";
    std::cout << "Количество оставшихся секунд с полуночи: " << s << "\r\n";
    // -- Задержка вывода на экран до нажатия клавиши "Ввод"
    std::cin.ignore();
    std::cin.get();
    return 0; // Выход из программы (функции)
}
